from math import sqrt


def get_roots(a, b, c):
    """Решает квадратное уравнение.

    Данная функция решает квадратные уравнения, имеющие вид
    a*x*x + b*x + c = 0

    Аргументы функции:
    a -- старший коэффициент уравнения
    b -- средний коэффициент уравнения
    c -- свободный член

    Функция возвращает кортеж из 2-х элементов.

    При этом содержимое кортежа зависит от значения дискриминанта:
    (None, None) - если дискриминант меньше нуля
    (корень1, None) - если дискриминант равен нулю
    (корень1, корень2) - если дискриминант больше нуля
    """
    discriminant = b ** 2 - 4 * a * c

    if discriminant < 0:
        return None, None

    root1 = (-b - sqrt(discriminant)) / (2 * a)
    root2 = (-b + sqrt(discriminant)) / (2 * a)

    if discriminant == 0:
        return root1, None
    else:
        return root1, root2
